require 'dry/monads'
require 'csv'

class CreateSignalValuesService
  include Dry::Monads[:result, :do]

  def call(batch)
    payload = batch.keys.reject{|key| key == 'DT'}.map do |batch_column|
      {
        value: batch[batch_column],
        signal_kind_id: signal_kind_ids(batch_column),
        batch_time: batch['DT'],
      }
    end
    signal_values = SignalValue.insert_all(
      payload
    )
    Success(signal_values)
  end

  def signal_kind_ids(name)
    {"ЭКСГАУСТЕР 4. ТОК РОТОРА 1"=>2909,
     "ЭКСГАУСТЕР 4. ТОК РОТОРА2"=>2910,
     "ЭКСГАУСТЕР 4. ТОК СТАТОРА"=>2911,
     "ЭКСГАУСТЕР 4. ДАВЛЕНИЕ МАСЛА В СИСТЕМЕ"=>2912,
     "ЭКСГАУСТЕР 4. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 1"=>2913,
     "ЭКСГАУСТЕР 4. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 2"=>2914,
     "ЭКСГАУСТЕР 4. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 3"=>2915,
     "ЭКСГАУСТЕР 4. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 4"=>2916,
     "ЭКСГАУСТЕР 4. ТЕМПЕРАТУРА МАСЛА В СИСТЕМЕ"=>2917,
     "ЭКСГАУСТЕР 4. ТЕМПЕРАТУРА МАСЛА В МАСЛОБЛОКЕ"=>2918,
     "ЭКСГАУСТЕР 4. ВИБРАЦИЯ НА ОПОРЕ 1"=>2919,
     "ЭКСГАУСТЕР 4. ВИБРАЦИЯ НА ОПОРЕ 2"=>2920,
     "ЭКСГАУСТЕР 4. ВИБРАЦИЯ НА ОПОРЕ 3"=>2921,
     "ЭКСГАУСТЕР 4. ВИБРАЦИЯ НА ОПОРЕ 3. ПРОДОЛЬНАЯ."=>2922,
     "ЭКСГАУСТЕР 4. ВИБРАЦИЯ НА ОПОРЕ 4"=>2923,
     "ЭКСГАУСТЕР 4. ВИБРАЦИЯ НА ОПОРЕ 4. ПРОДОЛЬНАЯ."=>2924,
     "ЭКСГАУСТЕР 5. ТОК РОТОРА 1"=>2925,
     "ЭКСГАУСТЕР 5. ТОК РОТОРА 2"=>2926,
     "ЭКСГАУСТЕР 5. ТОК СТАТОРА"=>2927,
     "ЭКСГАУСТЕР 5. ДАВЛЕНИЕ МАСЛА В СИСТЕМЕ"=>2928,
     "ЭКСГАУСТЕР 5. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 1"=>2929,
     "ЭКСГАУСТЕР 5. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 2"=>2930,
     "ЭКСГАУСТЕР 5. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 3"=>2931,
     "ЭКСГАУСТЕР 5. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 4"=>2932,
     "ЭКСГАУСТЕР 5. ТЕМПЕРАТУРА МАСЛА В СИСТЕМЕ"=>2933,
     "ЭКСГАУСТЕР 5. ТЕМПЕРАТУРА МАСЛА В МАСЛОБЛОКЕ"=>2934,
     "ЭКСГАУСТЕР 5. ВИБРАЦИЯ НА ОПОРЕ 1"=>2935,
     "ЭКСГАУСТЕР 5. ВИБРАЦИЯ НА ОПОРЕ 2"=>2936,
     "ЭКСГАУСТЕР 5. ВИБРАЦИЯ НА ОПОРЕ 3"=>2937,
     "ЭКСГАУСТЕР 5. ВИБРАЦИЯ НА ОПОРЕ 3. ПРОДОЛЬНАЯ."=>2938,
     "ЭКСГАУСТЕР 5. ВИБРАЦИЯ НА ОПОРЕ 4"=>2939,
     "ЭКСГАУСТЕР 5. ВИБРАЦИЯ НА ОПОРЕ 4. ПРОДОЛЬНАЯ."=>2940,
     "ЭКСГАУСТЕР 6. ТОК РОТОРА 1"=>2941,
     "ЭКСГАУСТЕР 6. ТОК РОТОРА 2"=>2942,
     "ЭКСГАУСТЕР 6. ТОК СТАТОРА"=>2943,
     "ЭКСГАУСТЕР 6. ДАВЛЕНИЕ МАСЛА В СИСТЕМЕ"=>2944,
     "ЭКСГАУСТЕР 6. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 1"=>2945,
     "ЭКСГАУСТЕР 6. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 2"=>2946,
     "ЭКСГАУСТЕР 6. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 3"=>2947,
     "ЭКСГАУСТЕР 6. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 4"=>2948,
     "ЭКСГАУСТЕР 6. ТЕМПЕРАТУРА МАСЛА В СИСТЕМЕ"=>2949,
     "ЭКСГАУСТЕР 6. ТЕМПЕРАТУРА МАСЛА В МАСЛОБЛОКЕ"=>2950,
     "ЭКСГАУСТЕР 6. ВИБРАЦИЯ НА ОПОРЕ 1"=>2951,
     "ЭКСГАУСТЕР 6. ВИБРАЦИЯ НА ОПОРЕ 2"=>2952,
     "ЭКСГАУСТЕР 6. ВИБРАЦИЯ НА ОПОРЕ 3"=>2953,
     "ЭКСГАУСТЕР 6. ВИБРАЦИЯ НА ОПОРЕ 3. ПРОДОЛЬНАЯ."=>2954,
     "ЭКСГАУСТЕР 6. ВИБРАЦИЯ НА ОПОРЕ 4"=>2955,
     "ЭКСГАУСТЕР 6. ВИБРАЦИЯ НА ОПОРЕ 4. ПРОДОЛЬНАЯ."=>2956,
     "ЭКСГАУСТЕР 7. ТОК РОТОРА 1"=>2957,
     "ЭКСГАУСТЕР 7. ТОК РОТОРА 2"=>2958,
     "ЭКСГАУСТЕР 7. ТОК СТАТОРА"=>2959,
     "ЭКСГАУСТЕР 7. ДАВЛЕНИЕ МАСЛА В СИСТЕМЕ"=>2960,
     "ЭКСГАУСТЕР 7. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 1"=>2961,
     "ЭКСГАУСТЕР 7. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 2"=>2962,
     "ЭКСГАУСТЕР 7. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 3"=>2963,
     "ЭКСГАУСТЕР 7. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 4"=>2964,
     "ЭКСГАУСТЕР 7. ТЕМПЕРАТУРА МАСЛА В СИСТЕМЕ"=>2965,
     "ЭКСГАУСТЕР 7. ТЕМПЕРАТУРА МАСЛА В МАСЛОБЛОКЕ"=>2966,
     "ЭКСГАУСТЕР 7. ВИБРАЦИЯ НА ОПОРЕ 1"=>2967,
     "ЭКСГАУСТЕР 7. ВИБРАЦИЯ НА ОПОРЕ 2"=>2968,
     "ЭКСГАУСТЕР 7. ВИБРАЦИЯ НА ОПОРЕ 3"=>2969,
     "ЭКСГАУСТЕР 7. ВИБРАЦИЯ НА ОПОРЕ 3. ПРОДОЛЬНАЯ."=>2970,
     "ЭКСГАУСТЕР 7. ВИБРАЦИЯ НА ОПОРЕ 4"=>2971,
     "ЭКСГАУСТЕР 7. ВИБРАЦИЯ НА ОПОРЕ 4. ПРОДОЛЬНАЯ."=>2972,
     "ЭКСГАУСТЕР 8. ТОК РОТОРА 1"=>2973,
     "ЭКСГАУСТЕР 8. ТОК РОТОРА 2"=>2974,
     "ЭКСГАУСТЕР 8. ТОК СТАТОРА"=>2975,
     "ЭКСГАУСТЕР 8. ДАВЛЕНИЕ МАСЛА В СИСТЕМЕ"=>2976,
     "ЭКСГАУСТЕР 8. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 1"=>2977,
     "ЭКСГАУСТЕР 8. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 2"=>2978,
     "ЭКСГАУСТЕР 8. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 3"=>2979,
     "ЭКСГАУСТЕР 8. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 4"=>2980,
     "ЭКСГАУСТЕР 8. ТЕМПЕРАТУРА МАСЛА В СИСТЕМЕ"=>2981,
     "ЭКСГАУСТЕР 8. ТЕМПЕРАТУРА МАСЛА В МАСЛОБЛОКЕ"=>2982,
     "ЭКСГАУСТЕР 8. ВИБРАЦИЯ НА ОПОРЕ 1"=>2983,
     "ЭКСГАУСТЕР 8. ВИБРАЦИЯ НА ОПОРЕ 2"=>2984,
     "ЭКСГАУСТЕР 8. ВИБРАЦИЯ НА ОПОРЕ 3"=>2985,
     "ЭКСГАУСТЕР 8. ВИБРАЦИЯ НА ОПОРЕ 3. ПРОДОЛЬНАЯ."=>2986,
     "ЭКСГАУСТЕР 8. ВИБРАЦИЯ НА ОПОРЕ 4"=>2987,
     "ЭКСГАУСТЕР 8. ВИБРАЦИЯ НА ОПОРЕ 4. ПРОДОЛЬНАЯ."=>2988,
     "ЭКСГАУСТЕР 9. ТОК РОТОРА 1"=>2989,
     "ЭКСГАУСТЕР 9. ТОК РОТОРА 2"=>2990,
     "ЭКСГАУСТЕР 9. ТОК СТАТОРА"=>2991,
     "ЭКСГАУСТЕР 9. ДАВЛЕНИЕ МАСЛА В СИСТЕМЕ"=>2992,
     "ЭКСГАУСТЕР 9. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 1"=>2993,
     "ЭКСГАУСТЕР 9. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 2"=>2994,
     "ЭКСГАУСТЕР 9. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 3"=>2995,
     "ЭКСГАУСТЕР 9. ТЕМПЕРАТУРА ПОДШИПНИКА НА ОПОРЕ 4"=>2996,
     "ЭКСГАУСТЕР 9. ТЕМПЕРАТУРА МАСЛА В СИСТЕМЕ"=>2997,
     "ЭКСГАУСТЕР 9. ТЕМПЕРАТУРА МАСЛА В МАСЛОБЛОКЕ"=>2998,
     "ЭКСГАУСТЕР 9. ВИБРАЦИЯ НА ОПОРЕ 1"=>2999,
     "ЭКСГАУСТЕР 9. ВИБРАЦИЯ НА ОПОРЕ 2"=>3000,
     "ЭКСГАУСТЕР 9. ВИБРАЦИЯ НА ОПОРЕ 3"=>3001,
     "ЭКСГАУСТЕР 9. ВИБРАЦИЯ НА ОПОРЕ 3. ПРОДОЛЬНАЯ."=>3002,
     "ЭКСГАУСТЕР 9. ВИБРАЦИЯ НА ОПОРЕ 4"=>3003,
     "ЭКСГАУСТЕР 9. ВИБРАЦИЯ НА ОПОРЕ 4. ПРОДОЛЬНАЯ."=>3004}[name]
  end

  def logger
    @logger ||= Logger.new('log/import_batch_signals_log.log')
  end
end
